InformationRegisters/АрхивФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АрхивФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АрхивФизическихЛицДокументыУдостоверяющиеЛичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АрхивФизическихЛицДокументыУдостоверяющиеЛичность</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АрхивФизическихЛицКонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АрхивФизическихЛицКонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредставлениеКонтактнойИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительноеПисьмо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСозданияКандидата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияКандидата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОценки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АрхивФизическихЛиц/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Добавляет в массив похожих людей похожие физические лица, находящиеся в архиве.
// 
// Параметры:
//  ДанныеФизическихЛиц - ТаблицаЗначений
//  МассивНайденных - Массив из СправочникСсылка.ФизическиеЛица
// 	ЧастиИмени - Структура:
// 	 * Фамилия - Строка
// 	 * Имя - Строка
// 	 * Отчество - Строка
Процедура ДополнитьДанныеФизическихЛиц(ДанныеФизическихЛиц, МассивНайденных, ЧастиИмени) Экспорт
	
	ДополнитьДанныеСубъектов(ДанныеФизическихЛиц, МассивНайденных, ЧастиИмени, "ФизическоеЛицо");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Дополняет таблицу поиска похожих физических лиц.
// 
// Параметры:
// 	ТаблицаПохожих - см. ДополнитьТаблицуПохожихСубъектов.ТаблицаПохожих
// 	ЧастиИмени - Структура:
// 	 * Фамилия - Строка
// 	 * Имя - Строка
// 	 * Отчество - Строка
// 	ТочноеСовпадение - Булево - признак того, что поиск выполняется по полному совпадению всех частей имени.
// 	ИсключаяФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо, которое нужно исключить из результатов.
//
Процедура ДополнитьТаблицуПохожихФизическихЛиц(ТаблицаПохожих, ЧастиИмени, ТочноеСовпадение, ИсключаяФизическоеЛицо) Экспорт

	ПараметрыДополнения = ПараметрыДополненияТаблицыПохожихСубъектов();
	ПараметрыДополнения.ИмяТаблицы = "ФизическиеЛица";
	ПараметрыДополнения.ЧастиИмени = ЧастиИмени;
	ПараметрыДополнения.ТочноеСовпадение = ТочноеСовпадение;
	ПараметрыДополнения.ИсключаяСубъект = ИсключаяФизическоеЛицо;
	
	ДополнитьТаблицуПохожихСубъектов(ТаблицаПохожих, ПараметрыДополнения);
	
КонецПроцедуры

// Дополняет таблицу поиска похожих кандидатов.
// 
// Параметры:
// 	ТаблицаПохожих - см. ДополнитьТаблицуПохожихСубъектов.ТаблицаПохожих
// 	ЧастиИмени - Структура:
// 	 * Фамилия - Строка
// 	 * Имя - Строка
// 	 * Отчество - Строка
// 	ТочноеСовпадение - Булево - признак того, что поиск выполняется по полному совпадению всех частей имени.
// 	ИсключаяЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - личные данные кандидата, которое нужно
// 	  исключить из результатов.
//
Процедура ДополнитьТаблицуПохожихКандидатов(ТаблицаПохожих, ЧастиИмени, ТочноеСовпадение, ИсключаяЛичныеДанныеКандидата) Экспорт

	ПараметрыДополнения = ПараметрыДополненияТаблицыПохожихСубъектов();
	ПараметрыДополнения.ИмяТаблицы = "ЛичныеДанныеКандидатов";
	ПараметрыДополнения.ИмяПоляСсылка = "ЛичныеДанныеКандидата";
	ПараметрыДополнения.ЧастиИмени = ЧастиИмени;
	ПараметрыДополнения.ТочноеСовпадение = ТочноеСовпадение;
	ПараметрыДополнения.ИсключаяСубъект = ИсключаяЛичныеДанныеКандидата;
	
	ДополнитьТаблицуПохожихСубъектов(ТаблицаПохожих, ПараметрыДополнения);
	
КонецПроцедуры

// Добавляет в массив похожих людей похожих кандидатов, находящихся в архиве.
// 
// Параметры:
//  ДанныеКандидатов - ТаблицаЗначений
//  МассивНайденных - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 	ЧастиИмени - Структура:
// 	 * Фамилия - Строка
// 	 * Имя - Строка
// 	 * Отчество - Строка
Процедура ДополнитьДанныеКандидатов(ДанныеКандидатов, МассивНайденных, ЧастиИмени) Экспорт
	
	ДополнитьДанныеСубъектов(ДанныеКандидатов, МассивНайденных, ЧастиИмени, "ЛичныеДанныеКандидата");
	
	Для Каждого ДанныеКандидата Из ДанныеКандидатов Цикл
		Если ДанныеКандидата.ВАрхивеФизическихЛиц Тогда
			ДанныеКандидата.EMail = "";
			ДанныеКандидата.Телефон = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиВСтрокеДанных(Результат, СтрокаДанных, ИскомыйТекст, ИскомыйНомер, СтандартнаяОбработка) Экспорт
	
	Если Не СтрокаДанных.ВАрхивеФизическихЛиц Тогда
		Возврат;
	КонецЕсли;	

	СтандартнаяОбработка = Ложь;
	
	ДанныеАрхива = СтрокаДанных.ДанныеАрхива;
	
	ИскомыйТекстАрхив = АрхивнаяСтрока(ИскомыйТекст);

	Если ДанныеАрхива.Фамилия = ИскомыйТекстАрхив Тогда
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "Фамилия";
		Возврат;
	КонецЕсли;

	Если ДанныеАрхива.Имя = ИскомыйТекстАрхив Тогда 
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "Имя";
		Возврат;
	КонецЕсли;

	Если ДанныеАрхива.Отчество = ИскомыйТекстАрхив Тогда 
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "Отчество";
		Возврат;
	КонецЕсли;

	Если ДанныеАрхива.АдресаПочты.Найти(ИскомыйТекстАрхив) <> Неопределено Тогда 
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "АдресЭлектроннойПочты";
		Возврат;
	КонецЕсли;

	ИскомаяДатаАрхив = АрхивнаяДата(ИскомыйТекст);
	Если Не ПустаяСтрока(ИскомаяДатаАрхив) Тогда
		Если ДанныеАрхива.ДатаРождения = ИскомаяДатаАрхив Тогда 
			Результат.Найдено = Истина;
			Результат.ИмяПоля = "ДатаРождения";
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИскомаяДатаСНулевымВременемАрхив = АрхивнаяДатаСНулевымВременем(ИскомыйТекст);
	Если Не ПустаяСтрока(ИскомаяДатаСНулевымВременемАрхив) Тогда
		Если ДанныеАрхива.ДатаРождения = ИскомаяДатаСНулевымВременемАрхив Тогда 
			Результат.Найдено = Истина;
			Результат.ИмяПоля = "ДатаРождения";
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИскомыйНомер = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИскомыйНомерАрхив = АрхивнаяСтрока(ИскомыйНомер);

	Если ДанныеАрхива.Телефоны.Найти(ИскомыйНомерАрхив) <> Неопределено Тогда 
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "МобильныйТелефон";
		Возврат;
	КонецЕсли;

	Если ДанныеАрхива.СНИЛС = ИскомыйНомерАрхив Тогда 
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "СтраховойНомерПФР";
		Возврат;
	КонецЕсли;

	Если ДанныеАрхива.ИНН = ИскомыйНомерАрхив Тогда 
		Результат.Найдено = Истина;
		Результат.ИмяПоля = "ИНН";
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица
//  ДанныеДляЗаполнения - Структура:
//   * ФИОПолные - Строка
//   * ДатаРождения - Дата
//   * МобильныйТелефон - Строка
//   * АдресЭлектроннойПочты - Строка
//   * СтраховойНомерПФР - Строка
//   * ИНН - Строка
Процедура ОбновитьФизическоеЛицоПоДаннымИзАрхива(ФизическоеЛицоСсылка, ДанныеДляЗаполнения) Экспорт
	
	ФизическоеЛицоОбъект = ФизическоеЛицоСсылка.ПолучитьОбъект();
	ФизическоеЛицоОбъект.Заблокировать();
	
	ДанныеФизическогоЛица = КадровыйУчет.НовыеДанныеФизическогоЛица();
	ЗаполнитьЗначенияСвойств(ДанныеФизическогоЛица, ДанныеДляЗаполнения, "ДатаРождения, ИНН, СтраховойНомерПФР");
	
	// Очистим контактную информацию, и затем добавим то, что нашли в архиве при поиске похожих.
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ФизическоеЛицоОбъект,
		УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация());
		
	СоответствиеКИ = ПодборПерсонала.ВидыКИФизическихЛицПоКИКандидатов();
		
	Если ЗначениеЗаполнено(ДанныеДляЗаполнения.МобильныйТелефон) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ФизическоеЛицоОбъект,
			ДанныеДляЗаполнения.МобильныйТелефон,
			СоответствиеКИ.Получить(ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов")));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЗаполнения.АдресЭлектроннойПочты) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ФизическоеЛицоОбъект,
			ДанныеДляЗаполнения.АдресЭлектроннойПочты,
			СоответствиеКИ.Получить(ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов")));
	КонецЕсли;
	
	КадровыйУчет.ЗаполнитьФизическоеЛицо(ФизическоеЛицоОбъект, ДанныеДляЗаполнения.ФИОПолные, ДанныеФизическогоЛица,
		ТекущаяДатаСеанса());
	
	ФизическоеЛицоОбъект.ДополнительныеСвойства.Вставить("УдалитьИзАрхива");
	
	ФизическоеЛицоОбъект.Записать();
	
КонецПроцедуры

#Область ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередСкрытиемПерсональныхДанныхСубъектов.
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия) Экспорт
	
	Если ОтказОтСкрытия Тогда
		Возврат;
	КонецЕсли;
	
	СубъектыИсключения = ТаблицаИсключений.ВыгрузитьКолонку("Субъект");
	СубъектыДляАрхивации = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Субъекты, СубъектыИсключения);
	
	ПоместитьВАрхив(СубъектыДляАрхивации);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.АрхивФизическихЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.АрхивФизическихЛицДокументыУдостоверяющиеЛичность, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.АрхивФизическихЛицКонтактнаяИнформация, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПомещениеВАрхив

// Параметры:
//  Субъекты - Массив из СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов -
Процедура ПоместитьВАрхив(Субъекты)
	
	Если Не ЗначениеЗаполнено(Субъекты) Тогда
		Возврат;
	КонецЕсли;
	
	ОписанияПричин = ОписанияПричинАрхивирования(Субъекты);
	
	Если ЗначениеЗаполнено(ОписанияПричин) Тогда
		ПоместитьФизическиеЛицаВАрхив(ОписанияПричин);
		ПоместитьЛичныеДанныеКандидатовВАрхив(ОписанияПричин);
		ПоместитьДокументыУдостоверяющиеЛичностьВАрхив(ОписанияПричин);
		ПоместитьКонтактнуюИнформациюВАрхив(ОписанияПричин);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  Субъекты - Массив из СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов - 
// 
// Возвращаемое значение:
//  Массив из см. ОписаниеСтруктурыПричины
Функция ОписанияПричинАрхивирования(Субъекты)

	ОписанияПричин = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеКандидатов = ПодборПерсонала.КандидатыФизическихЛиц(Субъекты);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(Субъекты),
		 ДанныеКандидатов);
	УстановитьПривилегированныйРежим(Ложь);
	
	ИменаКолонок =
		"Кандидат, ФизическоеЛицо, ЛичныеДанныеКандидата, Фамилия, Имя, Отчество, ДатаРождения, ПричинаОтклонения,
		|ДатаРешения, КомментарийРешения";
	ДанныеКандидатов.Свернуть(ИменаКолонок);

	Для Каждого Субъект Из Субъекты Цикл
		
		ТипСубъекта = ТипЗнч(Субъект);
		
		Если ТипСубъекта = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ИмяКолонки =  "ФизическоеЛицо";
		ИначеЕсли ТипСубъекта = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
			ИмяКолонки =  "ЛичныеДанныеКандидата";
		Иначе
			ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
				СтрШаблон(НСтр("ru = 'Неизвестный тип %1 субъекта %2'"), ТипСубъекта, Субъект),
				"АрхивФизическихЛиц.ОписанияПричинАрхивирования");
		КонецЕсли;
		
		ДанныеКандидатовСубъекта = ДанныеКандидатов.НайтиСтроки(Новый Структура(ИмяКолонки, Субъект));
		Если ДанныеКандидатовСубъекта.Количество() > 0 Тогда
			Для Каждого ДанныеКандидата Из ДанныеКандидатовСубъекта Цикл
				НовоеОписание = ОписаниеСтруктурыПричины();
				НовоеОписание.Объект = ДанныеКандидата.Кандидат;
				НовоеОписание.Субъект = Субъект;
				НовоеОписание.ДанныеКандидата = ДанныеКандидатаВСтруктуру(ДанныеКандидата, ИменаКолонок);
				ОписанияПричин.Добавить(НовоеОписание);
			КонецЦикла;
		Иначе
			НовоеОписание = ОписаниеСтруктурыПричины();
			НовоеОписание.Субъект = Субъект;
			ОписанияПричин.Добавить(НовоеОписание);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписанияПричин;
	
КонецФункции

// Возвращает структуру причины отклонения/увольнения для помещения "Объекта" в архив
//
// Возвращаемое значение:
//  Структура:
//   * Объект - СправочникСсылка.Кандидаты -
//   * Субъект - СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов - 
//   * ДанныеКандидата - Структура - 
Функция ОписаниеСтруктурыПричины()
	
	СтруктураПричины = Новый Структура;
	СтруктураПричины.Вставить("Объект", Справочники.Кандидаты.ПустаяСсылка());
	СтруктураПричины.Вставить("Субъект", Справочники.ФизическиеЛица.ПустаяСсылка());
	СтруктураПричины.Вставить("ДанныеКандидата", Новый Структура);
	
	Возврат СтруктураПричины;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Описание данных архива:
//   * Фамилия - Строка -
//   * Имя - Строка -
//   * Отчество - Строка -
//   * ДатаРождения - Дата -
//   * СНИЛС - Строка -
//   * ИНН - Строка -
//   * Документы - Массив из Строка -
//   * Телефоны - Массив из Строка -
//   * АдресаПочты - Массив из Строка -
Функция ОписаниеДанныхАрхива()
	
	Описание = Новый Структура;
	Описание.Вставить("Фамилия", "");
	Описание.Вставить("Имя", "");
	Описание.Вставить("Отчество", "");
	Описание.Вставить("ДатаРождения", Дата(1, 1, 1));
	Описание.Вставить("СНИЛС", "");
	Описание.Вставить("ИНН", "");
	Описание.Вставить("Документы", Новый Массив);
	Описание.Вставить("Телефоны", Новый Массив);
	Описание.Вставить("АдресаПочты", Новый Массив);
		
	Возврат Описание;

КонецФункции

// Параметры:
//  ДанныеКандидата - СтрокаТаблицыЗначений
//  ИменаКолонок - Строка
// 
// Возвращаемое значение:
//  Структура
Функция ДанныеКандидатаВСтруктуру(ДанныеКандидата, ИменаКолонок)
	
	Результат = Новый Структура(ИменаКолонок);
	ЗаполнитьЗначенияСвойств(Результат, ДанныеКандидата);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ОписанияПричин - см. ОписаниеСтруктурыПричины
Процедура ПоместитьФизическиеЛицаВАрхив(ОписанияПричин)
	
	ФизическиеЛица = Новый Массив;
	Для Каждого ОписаниеПричины Из ОписанияПричин Цикл
		Если ТипЗнч(ОписаниеПричины.Субъект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ФизическиеЛица.Добавить(ОписаниеПричины.Субъект);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ФизическиеЛица) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина, 
		ФизическиеЛица, 
		"ФизическоеЛицо,
		|Фамилия,
		|Имя,
		|Отчество,
		|ФИОПолные,
		|ДатаРождения,
		|ИНН,
		|СтраховойНомерПФР", 
		ТекущаяДатаСеанса());
	
	Для Каждого ОписаниеПричины Из ОписанияПричин Цикл
		НаборЗаписей = РегистрыСведений.АрхивФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ОписаниеПричины.Объект);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ОписаниеПричины.Субъект);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект = ОписаниеПричины.Объект;
		НоваяЗапись.ФизическоеЛицо = ОписаниеПричины.Субъект;
		
		ОтборСтрок = Новый Структура("ФизическоеЛицо", ОписаниеПричины.Субъект);
		НайденныеСтроки = ДанныеФизическихЛиц.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если ЗначениеЗаполнено(НайденнаяСтрока.Фамилия) Тогда
				НоваяЗапись.Фамилия = АрхивнаяСтрока(НайденнаяСтрока.Фамилия);
			КонецЕсли;
			Если ЗначениеЗаполнено(НайденнаяСтрока.Имя) Тогда
				НоваяЗапись.Имя = АрхивнаяСтрока(НайденнаяСтрока.Имя);
			КонецЕсли;
			Если ЗначениеЗаполнено(НайденнаяСтрока.Отчество) Тогда
				НоваяЗапись.Отчество = АрхивнаяСтрока(НайденнаяСтрока.Отчество);
			КонецЕсли;
			Если ЗначениеЗаполнено(НайденнаяСтрока.СтраховойНомерПФР) Тогда
				НоваяЗапись.СНИЛС = АрхивнаяСтрока(НайденнаяСтрока.СтраховойНомерПФР);
			КонецЕсли;
			Если ЗначениеЗаполнено(НайденнаяСтрока.ИНН) Тогда
				НоваяЗапись.ИНН = АрхивнаяСтрока(НайденнаяСтрока.ИНН);
			КонецЕсли;
			Если ЗначениеЗаполнено(НайденнаяСтрока.ДатаРождения) Тогда
				НоваяЗапись.ДатаРождения = АрхивнаяДата(НайденнаяСтрока.ДатаРождения);
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Параметры:
//  ОписанияПричин - см. ОписаниеСтруктурыПричины
Процедура ПоместитьЛичныеДанныеКандидатовВАрхив(ОписанияПричин)
	
	ЛичныеДанныеКандидатов = Новый Массив;
	Для Каждого ОписаниеПричины Из ОписанияПричин Цикл
		Если ТипЗнч(ОписаниеПричины.Субъект) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
			ЛичныеДанныеКандидатов.Добавить(ОписаниеПричины.Субъект);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидатов) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ОписаниеПричины Из ОписанияПричин Цикл
		НаборЗаписей = РегистрыСведений.АрхивФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ОписаниеПричины.Объект);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ОписаниеПричины.Субъект);
		
		ДанныеКандидата = ОписаниеПричины.ДанныеКандидата;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект = ОписаниеПричины.Объект;
		НоваяЗапись.ФизическоеЛицо = ОписаниеПричины.Субъект;
		НоваяЗапись.Комментарий = ДанныеКандидата.КомментарийРешения;
		НоваяЗапись.ПричинаОтклонения = ДанныеКандидата.ПричинаОтклонения;
		НоваяЗапись.ДатаРегистрации = ДанныеКандидата.ДатаРешения;
		
		Если ЗначениеЗаполнено(ДанныеКандидата.Фамилия) Тогда
			НоваяЗапись.Фамилия = АрхивнаяСтрока(ДанныеКандидата.Фамилия);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКандидата.Имя) Тогда
			НоваяЗапись.Имя = АрхивнаяСтрока(ДанныеКандидата.Имя);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКандидата.Отчество) Тогда
			НоваяЗапись.Отчество = АрхивнаяСтрока(ДанныеКандидата.Отчество);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКандидата.ДатаРождения) Тогда
			НоваяЗапись.ДатаРождения = АрхивнаяДата(ДанныеКандидата.ДатаРождения);
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Параметры:
//  ОписанияПричин - см. ОписаниеСтруктурыПричины
Процедура ПоместитьДокументыУдостоверяющиеЛичностьВАрхив(ОписанияПричин)
	
	Субъекты = ОбщегоНазначенияБЗККлиентСервер.ВыгрузитьКолонку(ОписанияПричин, "Субъект", Истина);

	ДокументыФизическихЛиц = КадровыйУчет.ДокументыФизическихЛиц(Субъекты, Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ОписаниеПричины Из ОписанияПричин Цикл
		НаборЗаписей = РегистрыСведений.АрхивФизическихЛицДокументыУдостоверяющиеЛичность.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ОписаниеПричины.Субъект);
		
		ОтборСтрок = Новый Структура("ФизическоеЛицо", ОписаниеПричины.Субъект);
		НайденныеСтроки = ДокументыФизическихЛиц.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ФизическоеЛицо = ОписаниеПричины.Субъект;
			НоваяЗапись.ДокументВид = НайденнаяСтрока.ВидДокумента;
			Если ЗначениеЗаполнено(НайденнаяСтрока.Серия) Тогда
				НоваяЗапись.ПредставлениеДокумента = АрхивныйДокументЛичности(
					НайденнаяСтрока.Серия, НайденнаяСтрока.Номер, НайденнаяСтрока.ДатаВыдачи);
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Параметры:
//  ОписанияПричин - см. ОписаниеСтруктурыПричины
Процедура ПоместитьКонтактнуюИнформациюВАрхив(ОписанияПричин)

	Субъекты = ОбщегоНазначенияБЗККлиентСервер.ВыгрузитьКолонку(ОписанияПричин, "Субъект", Истина);

	МассивТиповКонтактнойИнформации = Новый Массив;
	МассивТиповКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	МассивТиповКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	МассивТиповКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.Факс);
	КонтактнаяИнформацияФизическихЛиц = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(Субъекты,
		МассивТиповКонтактнойИнформации);

	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ОписаниеПричины Из ОписанияПричин Цикл
		НаборЗаписей = РегистрыСведений.АрхивФизическихЛицКонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ОписаниеПричины.Субъект);
		
		ОтборСтрок = Новый Структура("Объект", ОписаниеПричины.Субъект);
		НайденныеСтроки = КонтактнаяИнформацияФизическихЛиц.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ФизическоеЛицо = ОписаниеПричины.Субъект;
			НоваяЗапись.ВидКонтактнойИнформации = НайденнаяСтрока.Вид;
			Если ЗначениеЗаполнено(НайденнаяСтрока.Представление) Тогда
				НоваяЗапись.ПредставлениеКонтактнойИнформации = АрхивнаяСтрока(НайденнаяСтрока.Представление);
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПохожихВАрхиве

// Возвращаемое значение:
//  Структура:
// * ИмяТаблицы - Строка -
// * ИмяПоляСсылка - Строка -
// * ЧастиИмени - Структура -
// * ТочноеСовпадение - Булево -
// * ИсключаяСубъект - СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов -
Функция ПараметрыДополненияТаблицыПохожихСубъектов()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяТаблицы", "");
	Параметры.Вставить("ИмяПоляСсылка", "");
	Параметры.Вставить("ЧастиИмени", Новый Структура);
	Параметры.Вставить("ТочноеСовпадение", Ложь);
	Параметры.Вставить("ИсключаяСубъект", Справочники.ФизическиеЛица.ПустаяСсылка());
	
	Возврат Параметры;
	
КонецФункции

// Дополнить таблицу похожих субъектов.
// 
// Параметры:
//  ТаблицаПохожих - ТаблицаЗначений - таблица похожих людей, которую дополняем данными их архива
//   (см. СотрудникиФормы.ПохожиеФизическиеЛица):
//  ПараметрыДополнения - см. ПараметрыДополненияТаблицыПохожихСубъектов
Процедура ДополнитьТаблицуПохожихСубъектов(ТаблицаПохожих, ПараметрыДополнения)

	ЧастиИмени = ПараметрыДополнения.ЧастиИмени;

	ФамилияАрхив = АрхивнаяСтрока(ЧастиИмени.Фамилия);
	ИмяАрхив = АрхивнаяСтрока(ЧастиИмени.Имя);
	ОтчествоАрхив = АрхивнаяСтрока(ЧастиИмени.Отчество);

	Если ПустаяСтрока(ФамилияАрхив + " " + ИмяАрхив + " " + ОтчествоАрхив) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляДополненияТаблицыПохожихСубъектов(ПараметрыДополнения.ИмяТаблицы, ЧастиИмени,
		ПараметрыДополнения.ТочноеСовпадение);
		
	Запрос.УстановитьПараметр("ИсключаяСубъект", ПараметрыДополнения.ИсключаяСубъект);
	Запрос.УстановитьПараметр("ФамилияАрхив", ФамилияАрхив);
	Запрос.УстановитьПараметр("ИмяАрхив", ИмяАрхив);
	Запрос.УстановитьПараметр("ОтчествоАрхив", ОтчествоАрхив);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПохожих.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ЗначениеЗаполнено(ПараметрыДополнения.ИмяПоляСсылка) Тогда
			НоваяСтрока[ПараметрыДополнения.ИмяПоляСсылка] = Выборка.Ссылка;
		КонецЕсли;
		ПерезаполнитьНаименование = Ложь;
		Фамилия = Выборка.ФамилияСправочник;
		Если Выборка.ФамилияАрхив = ФамилияАрхив Тогда
			Фамилия = ЧастиИмени.Фамилия;
			ПерезаполнитьНаименование = Истина;
		КонецЕсли;
		Имя = Выборка.ИмяСправочник;
		Если Выборка.ИмяАрхив = ИмяАрхив Тогда
			Имя = ЧастиИмени.Имя;
			ПерезаполнитьНаименование = Истина;
		КонецЕсли;
		Отчество = Выборка.ОтчествоСправочник;
		Если Выборка.ОтчествоАрхив = ОтчествоАрхив Тогда
			Отчество = ЧастиИмени.Отчество;
			ПерезаполнитьНаименование = Истина;
		КонецЕсли;
		Если ПерезаполнитьНаименование Тогда
			НоваяСтрока.Наименование = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДляДополненияТаблицыПохожихСубъектов(ИмяТаблицы, ЧастиИмени, ТочноеСовпадение)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	АрхивФизическихЛиц.ФизическоеЛицо КАК Ссылка,
		|	СправочникСубъекта.Наименование КАК Наименование,
		|	СправочникСубъекта.УточнениеНаименования КАК УточнениеНаименования,
		|	АрхивФизическихЛиц.Фамилия КАК ФамилияАрхив,
		|	АрхивФизическихЛиц.Имя КАК ИмяАрхив,
		|	АрхивФизическихЛиц.Отчество КАК ОтчествоАрхив,
		|	СправочникСубъекта.Фамилия КАК ФамилияСправочник,
		|	СправочникСубъекта.Имя КАК ИмяСправочник,
		|	СправочникСубъекта.Отчество КАК ОтчествоСправочник,
		|	3 КАК Приоритет
		|ИЗ
		|	РегистрСведений.АрхивФизическихЛиц КАК АрхивФизическихЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникСубъекта
		|		ПО СправочникСубъекта.Ссылка = АрхивФизическихЛиц.ФизическоеЛицо
		|		И АрхивФизическихЛиц.ФизическоеЛицо <> &ИсключаяСубъект";
		
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ПакетЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	ОператорЗапроса = ПакетЗапроса.Операторы[0];
	
	ТаблицаСубъекта = ПакетЗапроса.ДоступныеТаблицы.Найти("Справочник." + ИмяТаблицы);
	ОператорЗапроса.Источники.Заменить(1, ТаблицаСубъекта);
	
	Если ТочноеСовпадение Тогда
		ОператорЗапроса.Отбор.Добавить("АрхивФизическихЛиц.Фамилия = &ФамилияАрхив");
		ОператорЗапроса.Отбор.Добавить("АрхивФизическихЛиц.Имя = &ИмяАрхив");
		ОператорЗапроса.Отбор.Добавить("АрхивФизическихЛиц.Отчество = &ОтчествоАрхив");
	Иначе
		Если Не ПустаяСтрока(ЧастиИмени.Фамилия) Тогда 
			ОператорЗапроса.Отбор.Добавить("АрхивФизическихЛиц.Фамилия = &ФамилияАрхив");
		КонецЕсли;
		Если Не ПустаяСтрока(ЧастиИмени.Имя) Тогда 
			ОператорЗапроса.Отбор.Добавить("АрхивФизическихЛиц.Имя = &ИмяАрхив");
		КонецЕсли;
		Если Не ПустаяСтрока(ЧастиИмени.Отчество) Тогда 
			ОператорЗапроса.Отбор.Добавить("АрхивФизическихЛиц.Отчество = &ОтчествоАрхив");
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДополнитьДанныеСубъектов(ДанныеСубъектов, МассивНайденных, ЧастиИмени, ИмяПоля)
	
	ДанныеСубъектов.Колонки.Добавить("ВАрхивеФизическихЛиц", Новый ОписаниеТипов("Булево"));
	ДанныеСубъектов.Колонки.Добавить("ДанныеАрхива");
	
	Запрос = ПакетЗапросовПоАрхивуФизическихЛиц(ДанныеСубъектов.ВыгрузитьКолонку(ИмяПоля));
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);

	Выборка = РезультатЗапроса[0].Выбрать();
	ВыборкаДокументов = РезультатЗапроса[1].Выбрать();
	ВыборкаКонтактов = РезультатЗапроса[2].Выбрать();
	
	ЧастиИмениАрхив = ОбщегоНазначения.СкопироватьРекурсивно(ЧастиИмени);
	ЧастиИмениАрхив.Фамилия = АрхивнаяСтрока(ЧастиИмени.Фамилия);
	ЧастиИмениАрхив.Имя = АрхивнаяСтрока(ЧастиИмени.Имя);
	ЧастиИмениАрхив.Отчество = АрхивнаяСтрока(ЧастиИмени.Отчество);
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеСубъектов, ИмяПоля);
	Пока Выборка.Следующий() Цикл
		ОтборСтрок = Новый Структура(ИмяПоля, Выборка.ФизическоеЛицо);
		НайденныеСтроки = ДанныеСубъектов.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаДанных = ДанныеСубъектов.Добавить();
			СтрокаДанных.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		Иначе
			СтрокаДанных = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаДанных.ВАрхивеФизическихЛиц = Истина;
		УстановитьФИО(СтрокаДанных, ЧастиИмени);
		ЗаполнитьДанныеАрхива(СтрокаДанных, Выборка, ВыборкаДокументов, ВыборкаКонтактов);
	КонецЦикла;
	
КонецПроцедуры

Функция ПакетЗапросовПоАрхивуФизическихЛиц(ФизическиеЛица)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АрхивФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	АрхивФизическихЛиц.Фамилия КАК Фамилия,
		|	АрхивФизическихЛиц.Имя КАК Имя,
		|	АрхивФизическихЛиц.Отчество КАК Отчество,
		|	АрхивФизическихЛиц.СНИЛС КАК СНИЛС,
		|	АрхивФизическихЛиц.ИНН КАК ИНН,
		|	АрхивФизическихЛиц.ДатаРождения КАК ДатаРождения,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.АрхивФизическихЛицДокументыУдостоверяющиеЛичность КАК АрхивДокументы
		|				ГДЕ
		|					АрхивДокументы.ФизическоеЛицо = АрхивФизическихЛиц.ФизическоеЛицо)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьДокументы,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.АрхивФизическихЛицКонтактнаяИнформация КАК АрхивКонтакты
		|				ГДЕ
		|					АрхивКонтакты.ФизическоеЛицо = АрхивФизическихЛиц.ФизическоеЛицо)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьКонтакты
		|ИЗ
		|	РегистрСведений.АрхивФизическихЛиц КАК АрхивФизическихЛиц
		|ГДЕ
		|	АрхивФизическихЛиц.ФизическоеЛицо В(&ФизическиеЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АрхивФизическихЛиц.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АрхивДокументы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	АрхивДокументы.ДокументВид КАК ДокументВид,
		|	АрхивДокументы.ПредставлениеДокумента КАК ПредставлениеДокумента
		|ИЗ
		|	РегистрСведений.АрхивФизическихЛицДокументыУдостоверяющиеЛичность КАК АрхивДокументы
		|ГДЕ
		|	АрхивДокументы.ФизическоеЛицо В(&ФизическиеЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АрхивДокументы.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АрхивКонтакты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	АрхивКонтакты.ВидКонтактнойИнформации КАК ВидКИ,
		|	АрхивКонтакты.ПредставлениеКонтактнойИнформации КАК ПредставлениеКонтактнойИнформации
		|ИЗ
		|	РегистрСведений.АрхивФизическихЛицКонтактнаяИнформация КАК АрхивКонтакты
		|ГДЕ
		|	АрхивКонтакты.ФизическоеЛицо В(&ФизическиеЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АрхивКонтакты.ФизическоеЛицо";
	
	Возврат Запрос;

КонецФункции

#КонецОбласти

#Область УдалениеИзАрхива

// Параметры:
//  Субъект - СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов -
Процедура УдалитьСубъектИзАрхива(Субъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		УдалитьИзРегистра(Субъект, Метаданные.РегистрыСведений.АрхивФизическихЛиц.Имя);
		УдалитьИзРегистра(Субъект, Метаданные.РегистрыСведений.АрхивФизическихЛицКонтактнаяИнформация.Имя);
		УдалитьИзРегистра(Субъект, Метаданные.РегистрыСведений.АрхивФизическихЛицДокументыУдостоверяющиеЛичность.Имя);
		ЗащитаПерсональныхДанныхЗарплатаКадры.УдалитьДанныеСубъекта(Субъект);
		ЗащитаПерсональныхДанных.ДобавитьСубъектыДляРасчетаСроковХранения(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Субъект), ТекущаяДатаСеанса());
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление из архива'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
//  Субъект - СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов -
//  ИмяРегистра - Строка
Процедура УдалитьИзРегистра(Субъект, ИмяРегистра)
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Субъект);
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

Процедура УстановитьФИО(СтрокаДанных, ЧастиИмени)
	
	ЗаполнитьЗначенияСвойств(СтрокаДанных, ЧастиИмени, "Фамилия, Имя, Отчество");

	ФИО = СокрЛП(ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФИОИзЧастей(СтрокаДанных));
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДанных, "ФИОПолные") Тогда
		СтрокаДанных.ФИОПолные = ФИО;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДанных, "ФИО") Тогда
		СтрокаДанных.ФИО = ФИО;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДанныеАрхива(СтрокаДанных, Выборка, ВыборкаДокументов, ВыборкаКонтактов)

	ОтборСтрок = Новый Структура("ФизическоеЛицо", Выборка.ФизическоеЛицо);
	
	ДанныеАрхива = ОписаниеДанныхАрхива();
	ЗаполнитьЗначенияСвойств(ДанныеАрхива, Выборка);
	
	Если Выборка.ЕстьДокументы Тогда
		Пока ВыборкаДокументов.НайтиСледующий(ОтборСтрок) Цикл
			ДанныеАрхива.Документы.Добавить(ВыборкаДокументов.ПредставлениеДокумента);
		КонецЦикла;
	КонецЕсли;
	
	Если Выборка.ЕстьКонтакты Тогда
		Пока ВыборкаКонтактов.НайтиСледующий(ОтборСтрок) Цикл
			
			Если ВыборкаКонтактов.ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица")
				Или ВыборкаКонтактов.ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов") Тогда
					
				ДанныеАрхива.Телефоны.Добавить(ВыборкаКонтактов.ПредставлениеКонтактнойИнформации);
				
			ИначеЕсли ВыборкаКонтактов.ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица")
				Или ВыборкаКонтактов.ВидКИ = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов") Тогда
					
				ДанныеАрхива.АдресаПочты.Добавить(ВыборкаКонтактов.ПредставлениеКонтактнойИнформации);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	СтрокаДанных.ДанныеАрхива = ОбщегоНазначения.ФиксированныеДанные(ДанныеАрхива);
	
КонецПроцедуры

Функция АрхивныйДокументЛичности(Серия, Номер, ДатаВыдачи)
	Возврат АрхивнаяСтрока(Серия + Номер + АрхивнаяДата(ДатаВыдачи));
КонецФункции

Функция АрхивнаяСтрока(Значение)
	
	СтрокаЗначения = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(
		":;!@#$%^&-~`'.,?{}[]+=*/|\ ()_""", ВРег(Строка(Значение)), "");
	
	Если ПустаяСтрока(СтрокаЗначения) Тогда
		Возврат "";
	КонецЕсли;
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(СтрокаЗначения);
	ХешСумма = СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	
	Возврат ХешСумма;
	
КонецФункции

Функция АрхивнаяДатаСНулевымВременем(Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	
	ДатаСтрокой = Строка(Дата);
	
	ЧастиСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ДатаСтрокой);
	Если ЧастиСтроки.Количество() < 3 Тогда
		Возврат "";
	КонецЕсли; 
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиСтроки[2]) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиСтроки[1]) Или Число(ЧастиСтроки[1]) > 12 Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиСтроки[0]) 
	 Или Число(ЧастиСтроки[0]) > ЗарплатаКадрыКлиентСервер.КоличествоДнейМесяца(Дата(1, ЧастиСтроки[1], 1)) Тогда
	 	Возврат "";
	КонецЕсли;
	
	Возврат АрхивнаяСтрока(Дата(Число(ЧастиСтроки[2]), Число(ЧастиСтроки[1]), Число(ЧастиСтроки[0])));
	
КонецФункции

Функция АрхивнаяДата(Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат АрхивнаяСтрока(АрхивнаяСтрока(Формат(Дата, "ДЛФ=D;")));
	
КонецФункции

#КонецОбласти
